---
type: SolidCurveIntersectionOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# SolidCurveIntersectionOptions

`Autodesk.Revit.DB.SolidCurveIntersectionOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | SolidCurveIntersectionOptions | 2013 | `public SolidCurveIntersectionOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ResultType | 2013 | `public SolidCurveIntersectionMode ResultType { get ; set ; }` |